#include <iostream>
#include <queue>

using namespace std;

int N, L;


int main() {
	cin >> N >> L;

	//ÀÔ·ÂÇÑ ¼ö Â¦¼ö -> È¦¼ö°¡ Â¦¼ö°³ ÀÏ¶§¸¸ °¡´É
	//È¦¼ö¿¡¼­ ½ÃÀÛ -> È¦Â¦È¦, È¦Â¦È¦Â¦, È¦Â¦È¦Â¦È¦Â¦È¦, È¦Â¦È¦Â¦È¦Â¦È¦Â¦
	//Â¦¼ö¿¡¼­ ½ÃÀÛ -> Â¦È¦Â¦È¦, Â¦È¦Â¦È¦Â¦, Â¦È¦Â¦È¦Â¦È¦Â¦È¦Â¦, 

	//ÀÔ·ÂÇÑ ¼ö È¦¼ö

	//n~ n+3ÀÇ ÇÕ -> 3n+3
	
	
	//n = Ãâ·ÂÇÒ ¹è¿­¿¡¼­ ÃÖ´ëÇÑ °¡¿îµ¥ ¼ö
	//n - 2, n - 1, n, n +1 -> 4n -2
	//¹è¿­ÀÇ ±æÀÌ Â¦¼ö
	//2, 4, 6, 8, 10
	//2 = 2n -1
	//4 = 4n -2
	//6 = 6n -3
	//8 = 8n -4
	// => LÀÌ È¦¼öÀÏ¶§¸¸ °¡´É

	//¹è¿­ÀÇ ±æÀÌ È¦¼ö
	//n-2, n-1, n, n+1, n+2 -> 5n
	//1, 3, 5, 7, 9
	//3 = 3n
	//5 = 5n
	//7 = 7n
	// => LÀÌ Â¦¼ö È¦¼ö ´Ù °¡´É

	int result_n = 0;

	//n 
	for (int n = 1; n < 200; n++) {
		//¹è¿­ÀÇ ±æÀÌ
		for (int j = 2; j < 101; j++) {
			int result;
			if (j % 2 == 0) {
				result = n * j - (j / 2);

				if (result == N) {
					result_n = n;
					return 0;
				}
			}
			else {
				result = n * j;

				if (result == N) {
					for (int k = 0; k < j; k++) {
						result_n = n;
						return 0;
					}
				}
			}
		}
	}

	return 0;
}